#include <s3c2440.h>
#include "gui.h"
#include "sys.h"
#include "LCD.h"

/*******************************************************
 * 函数名称：GPB_Conf
 * 描述说明：GPB引脚配置函数
 * 输入参数：无
 * 输出参数：无
*******************************************************/
void GPB_Conf()
{
	GPBCON = 0x155555;				// 设置GPB为输出属性
	GPBUP = 0x7FF;					// 禁止GPB端口的上拉	
}

/*******************************************************
 * 函数名称：delay
 * 描述说明：延时
 * 输入参数：unsigned int t要延时的周期数
 * 输出参数：无
*******************************************************/
void delay(unsigned int t)
{
	unsigned int i;
	for(;t>0;t--)
	{
		for(i=0;i<10000;i++)
		{}
	}
}

/*******************************************************
 * 函数名称：Led_Out
 * 描述说明：LED输出显示函数
 * 输入参数：data传递给LED灯的控制信号：1亮/0灭
 * 输出参数：无
 * 备    注：该函数控制连接在GPB5~8的4个LED灯点亮或熄灭 
*******************************************************/ 
void Led_Out(int data)
{
    GPBDAT = (GPBDAT & ~(0xf<<5)) | ((~data & 0xf)<<5); 
}
